{
  "usernameExists": "Déjà existant. Veuillez utiliser un autre nom d'utilisateur.",
  "usernameExists1": "Déjà existant. Veuillez utiliser un autre nom d'utilisateur et ",
  "emailExists": "Déjà existant. Veuillez utiliser une autre adresse e-mail.",
  "emailExists1": "Déjà existant. Veuillez utiliser une autre adresse e-mail.",
  "user_creat_success": "Utilisateur {{username}} avec l'e-mail {{email}} créé avec succès",
  "errorCreatingUser": "Une erreur s'est produite lors de la création de l'utilisateur",
  "loginRequired": "Nom d'utilisateur et mot de passe sont nécessaires",
  "loginSuccess": "Connexion réussie",
  "alreadyLoggedIn": "{{username}} vous êtes déjà connecté",
  "invalidCredentials": "Nom d'utilisateur ou mot de passe invalide. Veuillez réessayer avec des informations de connexion valides",
  "logoutSuccess": "Utilisateur déconnecté avec succès",
  "alreadyLoggedOut": "Vous êtes déjà déconnecté. Vous pouvez vous reconnecter",
  "errorLoggingOut": "Erreur lors de la déconnexion de l'utilisateur",
  "mustBeLoggedInToGetUser": "Vous devez être connecté pour obtenir les utilisateurs",
  "userNotFound": "Utilisateur non trouvé",
  "userFound": "Utilisateur trouvé avec succès",
  "notAuthorized": "Vous n'êtes pas autorisé à effectuer cette action",
  "errorGettingUser": "Erreur lors de la récupération de l'utilisateur",
  "loginRequired1": "Vous devez être connecté pour mettre à jour votre profil",
  "userupdated":"Utilisateur mis à jour avec succès",
  "errorUpdatingUser": "Erreur lors de la mise à jour de l'utilisateur",
  "loginRequired2": "Vous devez être connecté pour supprimer votre compte",
  "userDeleted1": "Vous avez supprimé votre compte avec succès",
  "loginRequired3": "Vous devez être connecté pour supprimer un utilisateur",
  "userDeleted": "Utilisateur supprimé avec succès",
  "errorDeletingUser": "Erreur lors de la suppression de l'utilisateur",
  "loginRequired4": "Vous devez être connecté pour supprimer tous les utilisateurs",
  "noUsersFound": "Aucun utilisateur trouvé",
  "allUsersDeleted": "Tous les utilisateurs supprimés avec succès",
  "errorDeletingAllUsers": "Erreur lors de la suppression de tous les utilisateurs",
  "loginRequired5": "Vous devez être connecté pour obtenir tous les utilisateurs",
  "errorGettingAllUsers": "Erreur lors de la récupération de tous les utilisateurs",
  "loginRequired6": "Vous devez être connecté pour mettre à jour votre mot de passe",
  "invalidCurrentPassword": "Mot de passe actuel invalide",
  "passwordUpdated": "Mot de passe mis à jour avec succès",
  "errorUpdatingPassword": "Erreur lors de la mise à jour du mot de passe",

  "mustBeLoggedInToUploadFiles": "Vous devez être connecté pour télécharger des fichiers",
  "invalidFileType": "Téléchargez un fichier avec un type de fichier valide. Seuls les fichiers JPEG, PNG et PDF sont autorisés",
  "fileSizeLimitExceeded": "La taille du fichier dépasse la limite autorisée. La taille maximale autorisée est de 0,5 Mo/500 Ko",
  "fileUploadedSuccessfully": "Fichier téléchargé avec succès",
  "errorSavingFileToDatabase": "Il y a eu un problème pour enregistrer le fichier dans la base de données",
  "noFilesUploaded": "Aucun fichier n'a été téléchargé dans la base de données pour le moment",
  "errorUploadingFile": "Il y a eu un problème pour télécharger le fichier",
  "errorGettingFiles": "Il y a eu un problème pour récupérer les fichiers",
  "noFilesUploaded1": "Vous n'avez pas encore téléchargé de fichiers dans la base de données",
  "noFilesUploaded2": "Cet utilisateur n'a pas encore téléchargé de fichiers dans la base de données",
  "mustBeLoggedInToViewAllFiles": "Vous devez être connecté pour afficher tous les fichiers",
  "mustBeLoggedInToViewYourFiles": "Vous devez être connecté pour afficher vos fichiers",
  "mustBeLoggedInToViewOtherUsersFiles": "Vous devez être connecté pour afficher les fichiers de cet utilisateur",
  "errorGettingYourFiles": "Il y a eu un problème pour récupérer vos fichiers",
  "errorGettingOtherUsersFiles": "Il y a eu un problème pour récupérer les fichiers de cet utilisateur",
  "mustBeLoggedInToDeleteYourFiles": "Vous devez être connecté pour supprimer vos fichiers",
  "fileNotFound": "Fichier non trouvé",
  "fileDeletedSuccessfully": "Fichier supprimé avec succès",
  "notAuthorizedToDeleteFile": "Vous n'êtes pas autorisé à supprimer ce fichier",
  "errorDeletingFile": "Il y a eu un problème pour supprimer ce fichier",
  "mustBeLoggedInToDeleteAllFiles": "Vous devez être connecté pour supprimer tous les fichiers",
  "notAuthorizedToDeleteAllFiles": "Vous n'êtes pas autorisé à supprimer tous les fichiers pour tous les utilisateurs",
  "noFilesFound": "Aucun fichier trouvé",
  "allFilesDeletedSuccessfully": "Tous les fichiers ont été supprimés avec succès",
  "errorDeletingAllFiles": "Il y a eu un problème pour supprimer tous les fichiers",
  "mustBeLoggedInToDownloadFile": "Vous devez être connecté pour télécharger ce fichier",
  "errorDownloadingFile": "Il y a eu un problème pour télécharger ce fichier",
  "notAuthorizedToDownloadFile": "Vous n'êtes pas autorisé à télécharger ce fichier",
  "mustBeLoggedInToDeleteAllYourFiles": "Vous devez être connecté pour supprimer tous vos fichiers",
  "allYourFilesDeletedSuccessfully": "Tous vos fichiers ont été supprimés avec succès",
  "errorDeletingAllYourFiles": "Il y a eu un problème pour supprimer tous vos fichiers",
  "mustBeLoggedInToDeleteAllOtherUsersFiles": "Vous devez être connecté pour supprimer tous les fichiers de cet utilisateur",
  "notAuthorizedToDeleteAllOtherUsersFiles": "Vous n'êtes pas autorisé à supprimer tous les fichiers de cet utilisateur",
  "allOtherUsersFilesDeletedSuccessfully": "Tous les fichiers de cet utilisateur ont été supprimés avec succès",
  "errorDeletingAllThisUsersFiles": "Il y a eu un problème pour supprimer tous les fichiers de cet utilisateur",
  "mustBeLoggedInToUpdateFileName": "Vous devez être connecté pour mettre à jour le nom du fichier",
  "errorUpdatingFileName": "Il y a eu un problème pour mettre à jour le nom du fichier",
  "notAuthorizedToUpdateFileName": "Vous n'êtes pas autorisé à mettre à jour le nom du fichier",
  "filenameAlreadyExists": "Un fichier avec le même nom existe déjà",
  "fileNameUpdatedSuccessfully": "Nom du fichier mis à jour avec succès",
  "UploadedSuccessfully": "Fichier telechargeé avec sucees",

  "mustBeLoggedInToViewSessions": "Vous devez être connecté pour afficher toutes les sessions pour tous les utilisateurs",
  "noSessionsFound": "Aucune session trouvée",
  "errorGettingSessions": "Erreur lors de la récupération des sessions",
  "errorGettingThisUsersSessions": "Erreur lors de la récupération des sessions de cet utilisateur",
  "notAuthorizedToViewSessions": "Vous n'êtes pas autorisé à afficher les sessions",
  "mustBeLoggedInToViewThisUsersSessions": "Vous devez être connecté pour afficher les sessions de cet utilisateur",
  "noSessionsFound1": "Aucune session trouvée pour cet utilisateur",
  "allSessionsDeletedSuccessfully": "Toutes les sessions ont été supprimées avec succès",
  "errorDeletingAllSessions": "Erreur lors de la suppression de toutes les sessions",
  "noSessionsFoundForThisUser": "Aucune session trouvée pour cet utilisateur",
  "notAuthorizedToViewThisUsersSessions": "Vous n'êtes pas autorisé à afficher les sessions de cet utilisateur",
  "mustBeLoggedInToDeleteAllOtherUsersSessions": "Vous devez être connecté pour supprimer toutes les sessions de cet utilisateur",
  "notAuthorizedToDeleteAllOtherUsersSessions": "Vous n'êtes pas autorisé à supprimer toutes les sessions de cet utilisateur",
  "allOtherUsersSessionsDeletedSuccessfully": "Toutes les sessions de cet utilisateur ont été supprimées avec succès",
  "errorDeletingAllThisUsersSessions": "Il y a eu un problème pour supprimer toutes les sessions de cet utilisateur",
  
  "invalidPassword": "Mot de passe invalide"
}
